Конфигурация отчетов/Documents/РаботаСДатамиЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РаботаСДатамиЗадач</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДатыЗадачи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиДатЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Documents/РаботаСДатамиЗадач/Ext/ManagerModule.bsl
Функция СоздатьРаботуСДатами(ХарактеристикаДаты, Задача, НоваяДата) Экспорт 
	
	Док = Документы.РаботаСДатамиЗадач.СоздатьДокумент();
	Док.Дата               = ТекущаяДата();
	Док.ХарактеристикаДаты = ХарактеристикаДаты; 
	Док.Задача    		   = Задача; 
	Док.НоваяДата 	   = НоваяДата;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	
	Документы.ДобавитьСвязьОбъектов.СоздатьСвязьОбъектов(Задача, Док.Ссылка);

	Возврат Док.Ссылка;
	
КонецФункции
